owhinata/stm32f746g-disco/port/camera/camera.c
/* Apply the cached quality settings AND refresh the exposure-aware VTS in one
   shot.  This is the only path that touches sensor timing, so it is used by the
   operations that actually change the AEC ceiling or base VTS: night toggle,
   resolution/format change, and configure (SDE/geometry-only setters use the
   no-timing apply_if_live_locked()).  night ON raised both AEC max-exposure pairs
   to ~0x0B88 inside settings_apply_all_locked(); when night is OFF the vendored
   DISABLE leaves them stuck high, so restore the daylight ceiling here before the
   VTS clamp reads it -- otherwise the effective VTS (and fps) never come back down
   (#70).  Timing failures re-arm timing_dirty (NOT settings_dirty, which the SDE
   block already cleared) so a later live setter / configure retries just the
   timing step without an SDE-only apply silently dropping it.  Caller holds
   cam_lock with the sensor configured and the mode committed. */
static int settings_and_timing_apply_locked(void)
{
	int rc = settings_apply_all_locked();   /* clears settings_dirty on success */

	if (rc != 0) {
		timing_dirty = 1;
		return rc;
	}
	if (settings.night == 0 && restore_aec_max_default_locked() != 0) {
		timing_dirty = 1;     /* do NOT clamp VTS off a stale night ceiling */
		LOG_ERR("OV5640 AEC ceiling restore failed (I2C)");
		return CAM_ERR_HAL;
	}
	rc = apply_vts_locked();
	if (rc != 0) {
		timing_dirty = 1;
		return rc;
	}
	timing_dirty = 0;         /* SDE and timing both match the sensor now */
	return 0;
}

/* Apply now if the sensor is live; otherwise the cache is enough.  Cache-only
   when not configured (the next capture's lazy configure re-applies it after
   OV5640_Init wipes the SDE block) or while the colorbar test pattern is up
   (returning to live re-applies, and we must not disturb its SDE_CTRL4).

   For SDE/geometry-only setters (brightness..zoom) this does NOT reclamp the VTS:
   those settings cannot change the AEC max exposure, so re-running the exposure-
   aware VTS clamp on every tweak only risked dropping fps for no reason (#70).
   The one exception is a pending timing retry (timing_dirty): then fall back to
   the full timing apply so a prior failed ceiling-restore / VTS clamp recovers on
   the next live operation instead of waiting for the next configure. */
static int apply_if_live_locked(void)
{
	if (!info.configured || cam_colorbar != 0)
		return 0;
	if (timing_dirty)
		return settings_and_timing_apply_locked();
	return settings_apply_all_locked();
}

/* Like apply_if_live_locked() but always refreshes the timing (AEC ceiling +
   VTS): used by the operations that change the AEC max exposure / base VTS --
   night toggle and defaults reset (resolution/format and configure call
   settings_and_timing_apply_locked() directly). */
static int apply_with_timing_if_live_locked(void)
{
	if (!info.configured || cam_colorbar != 0)
		return 0;
	return settings_and_timing_apply_locked();
}

/* ---- capture (locked helpers, issue #41) ---------------------------------- */

/* Remove any leftover signals so a stale post cannot satisfy the next wait. */
static void drain_done(void)
{
	while (tx_semaphore_get(&cam_done, TX_NO_WAIT) == TX_SUCCESS)
		;
}

/* Program the sensor for QVGA RGB565 (once after each power-up) and select
   the live / colorbar source.  Both paths sleep so AEC/AWB or the pattern
   switch settles before the snapshot. */
static int camera_configure_locked(int colorbar)
{
	if (!info.configured) {
		if (OV5640_Init(&ov5640, OV5640_R320x240, OV5640_RGB565)
		    != OV5640_OK) {
			LOG_ERR("OV5640_Init failed");
			return CAM_ERR_HAL;
		}
		info.configured = 1;
		cam_colorbar    = -1;   /* forces the mode block below to run */
		cam_sensor_pclk_hz = 0u;   /* Init reset the PLL; apply_effective re-sets (#67) */
		tx_thread_sleep(CAM_SETTLE_INIT_MS);
	}

	if (cam_colorbar != colorbar) {
		if (OV5640_ColorbarModeConfig(&ov5640,
		                              colorbar ? COLORBAR_MODE_ENABLE
		                                       : COLORBAR_MODE_DISABLE)
		    != OV5640_OK) {
			LOG_ERR("OV5640 colorbar config failed");
			return CAM_ERR_HAL;
		}
		tx_thread_sleep(CAM_SETTLE_MODE_MS);

		/* Re-apply the cached quality settings LAST, in live mode only:
		   OV5640_Init and ColorbarModeConfig(DISABLE) both write the SDE
		   register block (the latter sets SDE_CTRL4), so the settings must
		   land after them or they get clobbered (issue #44).  The colorbar
		   test pattern owns its own SDE_CTRL4 and ignores quality, so skip
		   it there.  cam_colorbar is committed only after a successful apply
		   so a failed apply re-runs this block on the next capture. */
		if (!colorbar) {
			int rc = settings_and_timing_apply_locked();

			if (rc != 0)
				return rc;
		}
		cam_colorbar = colorbar;
	}

	/* Mode unchanged but a prior live apply failed: retry so the sensor matches
	   the cache.  settings_dirty covers the SDE/geometry/night cache; timing_dirty
	   covers a failed AEC-ceiling restore / VTS clamp (which an SDE-only apply does
	   not re-run, #70).  Either one means a full timing apply is owed.  Skipped in
	   colorbar mode -- quality is irrelevant there and would disturb the test
	   pattern's SDE_CTRL4. */
	if (!colorbar && (settings_dirty || timing_dirty)) {
		int rc = settings_and_timing_apply_locked();

		if (rc != 0)
			return rc;
	}
	return 0;
}

/* ---- mode switch: resolution / pixel format / fps (issue #45) ------------- */

/*
 * Per-resolution timing table.  fps = pclk_hz / (hts * vts); the PCLK is no longer
 * a fixed column -- it is the runtime fps knob (#67), see effective_ov_pclk().
 * HTS/VTS is tightened on the small streamable modes (1600x1000) so 24 MHz gives a
 * clean ~15 fps and 48 MHz exactly doubles it to ~30 fps (48e6/(1600*1000)=30.0);
 * VGA/WVGA keep the full common timing (snapshot-only, frame rate irrelevant, and
 * pinned to 24 MHz).  VTS is the BASE: apply_vts_locked() raises the effective VTS
 * when the AEC max exposure needs more lines and drops it back to this base.
 */
static const struct {
	uint16_t hts;
	uint16_t vts;
} mode_fps[CAM_RES__COUNT] = {
	[CAM_RES_QQVGA]   = { 1600u, 1000u },
	[CAM_RES_QVGA]    = { 1600u, 1000u },
	[CAM_RES_VGA]     = { 1936u, 1088u },
	[CAM_RES_WVGA]    = { 1936u, 1088u },
};

/* Only the small modes (QQVGA/QVGA) are streamable and worth 48 MHz; the larger
   VGA/WVGA modes are snapshot-only and stay at 24 MHz regardless of fps. */
static int res_is_small(uint8_t res)
{
	return res <= CAM_RES_QVGA;
}

struct cam_pclk_sel { uint8_t ov; uint32_t hz; };

