owhinata/stm32f746g-disco/port/camera/camera.c
int camera_set_fps(unsigned fps)
{
	uint8_t prev;
	int rc;

	if (fps != 15u && fps != 30u)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	/* Re-apply to the live sensor the same way `camera res` / `camera format` do:
	   rebuild the current mode so the new effective PCLK is reprogrammed at once.
	   Inherits the set_format BUSY gate (refused while a stream/preview owns the
	   DCMI) -- the sensor PLL must not be retuned under a live DMA target (#67).
	   On any failure (BUSY / I/O) restore the previous selection so the stored
	   preference never diverges from what the sensor actually got -- otherwise
	   camera_get_mode() would report an fps the live sensor never received. */
	prev = cam_fps_sel;
	cam_fps_sel = (uint8_t)fps;
	rc = camera_set_format_locked(mode.res, mode.format);
	if (rc != 0)
		cam_fps_sel = prev;
	op_unlock();
	return rc;
}

int camera_frame_read(uint32_t offset, void *dst, uint32_t len,
                      uint32_t *gen)
{
	int rc;

	if (dst == NULL || len == 0u)
		return CAM_ERR_PARAM;

	rc = op_lock();
	if (rc != 0)
		return rc;
	if (!info.frame_valid) {
		op_unlock();
		return CAM_ERR_NO_FRAME;
	}
	/* Bound against the captured frame's valid length under the lock: the live
	   mode (hence the valid byte count, and for JPEG the trimmed stream length)
	   can change between captures.  Subtraction form so offset+len cannot wrap. */
	if (offset >= info.frame_bytes ||
	    len > info.frame_bytes - offset) {
		op_unlock();
		return CAM_ERR_PARAM;
	}
	memcpy(dst, (const uint8_t *)cam_frame + offset, len);
	if (gen != NULL)
		*gen = cam_frame_gen;
	op_unlock();
	return 0;
}

void camera_frame_invalidate(void)
{
	if (op_lock() != 0)
		return;
	info.frame_valid = 0;
	op_unlock();
}

int camera_streaming(void)
{
	return cam_stream_active;   /* volatile; a destructive .sdram op must refuse */
}

int camera_probe(uint32_t *chip_id)
{
	int rc = op_lock();
	if (rc != 0)
		return rc;
	if (cam_stream_active) {          /* streaming owns the sensor/DCMI (#46) */
		op_unlock();
		return CAM_ERR_BUSY;
	}
	rc = camera_probe_locked(chip_id);
	op_unlock();
	return rc;
}

int camera_power_off(void)
{
	int rc = op_lock();
	if (rc != 0)
		return rc;
	if (cam_stream_active) {          /* cutting power mid-stream wrecks the HW */
		op_unlock();
		return CAM_ERR_BUSY;
	}
	power_off_locked();
	op_unlock();
	return 0;
}

int camera_get_info(struct camera_info *out)
{
	int rc;

	if (out == NULL)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	*out = info;
	op_unlock();
	return 0;
}

int camera_get_mode(struct camera_mode *out)
{
	struct cam_pclk_sel sel;
	int rc;

	if (out == NULL)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	*out = mode;
	/* Evaluate the fps clamp live against the current LTDC scanout state (#67), so
	   `camera info` reflects whether 30 fps is actually in effect right now -- the
	   sensor PCLK is only re-applied at the next capture/stream arm, but the report
	   must be current.  Report the live-effective PCLK / fps target, not a stale
	   last-programmed value. */
	sel = effective_ov_pclk(mode.res);
	out->fps_sel = cam_fps_sel;
	out->fps_eff = (sel.hz >= 48000000u) ? 30u : 15u;
	if (cam_fps_sel == 30u && out->fps_eff == 15u)
		out->fps_clamp = res_is_small(mode.res) ? CAM_FPS_CLAMP_LTDC
		                                        : CAM_FPS_CLAMP_SIZE;
	else
		out->fps_clamp = CAM_FPS_OK;
	out->pclk_hz = sel.hz;
	/* fps target = effective PCLK / (HTS x effective VTS).  Use the VTS actually
	   programmed in the sensor, not the fps-table base, so the report follows the
	   exposure-aware VTS reclamp (night mode raises VTS -> lower fps).  Otherwise
	   the field would mix a live PCLK with a base VTS and read 15.0 while the sensor
	   runs at ~5 fps in night mode (#71).  Read it back when configured (the sensor
	   is the source of truth); fall back to the base table value otherwise or on a
	   read error. */
	{
		uint16_t vts = mode.vts;

		if (info.configured)
			(void)read_reg_u16(OV5640_TIMING_VTS_HIGH, OV5640_TIMING_VTS_LOW,
			                   &vts);
		if (mode.hts != 0u && vts != 0u)
			out->fps_target_x10 = (uint16_t)((uint64_t)sel.hz * 10u /
			                                 ((uint32_t)mode.hts * vts));
	}
	op_unlock();
	return 0;
}

/* ---- quality settings public API (issue #44) ----------------------------- */

int camera_get_settings(struct camera_settings *out)
{
	int rc;

	if (out == NULL)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	*out = settings;
	op_unlock();
	return 0;
}

/* Shared tail for every level setter: takes the mutex, stashes the validated
   value (already range-checked) and re-applies if the sensor is live.
   @field points into `settings`. */
static int set_level(int8_t *field, int value)
{
	int rc = op_lock();

	if (rc != 0)
		return rc;
	*field = (int8_t)value;
	settings_dirty = 1;
	rc = apply_if_live_locked();
	op_unlock();
	return rc;
}

int camera_set_brightness(int level)
{
	if (level < CAM_LEVEL_MIN || level > CAM_LEVEL_MAX)
		return CAM_ERR_PARAM;
	return set_level(&settings.brightness, level);
}

int camera_set_contrast(int level)
{
	if (level < CAM_LEVEL_MIN || level > CAM_LEVEL_MAX)
		return CAM_ERR_PARAM;
	return set_level(&settings.contrast, level);
}

int camera_set_saturation(int level)
{
	if (level < CAM_LEVEL_MIN || level > CAM_LEVEL_MAX)
		return CAM_ERR_PARAM;
	return set_level(&settings.saturation, level);
}

int camera_set_hue(int degrees)
{
	if (degrees < CAM_HUE_MIN * 30 || degrees > CAM_HUE_MAX * 30 ||
	    (degrees % 30) != 0)
		return CAM_ERR_PARAM;
	return set_level(&settings.hue, degrees / 30);
}

int camera_set_awb(enum camera_awb mode)
{
	int rc;

	if ((unsigned)mode > CAM_AWB_CLOUDY)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	settings.awb = (uint8_t)mode;
	settings_dirty = 1;
	rc = apply_if_live_locked();
	op_unlock();
	return rc;
}

int camera_set_effect(enum camera_effect effect)
{
	int rc;

	if ((unsigned)effect > CAM_FX_GREEN)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	settings.effect = (uint8_t)effect;
	settings_dirty = 1;
	rc = apply_if_live_locked();
	op_unlock();
	return rc;
}

int camera_set_flip(enum camera_flip flip)
{
	int rc;

	if ((unsigned)flip > CAM_FLIP_BOTH)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	settings.flip = (uint8_t)flip;
	settings_dirty = 1;
	rc = apply_if_live_locked();
	op_unlock();
	return rc;
}

int camera_set_zoom(int factor)
{
	int rc;

