owhinata/stm32f746g-disco/port/camera/camera.c
/* Dedicated producer (priority 10).  When no stream is running it sleeps
   indefinitely (0 CPU) on the start semaphore; while active it bounded-waits on
   the completion semaphore so --secs / stop / OVR fire even if frames stop
   arriving.  The two signals are SEPARATE semaphores on purpose: the start
   wakeup must never be consumed by the active bounded wait (it would be
   miscounted as a frame completion -> a spurious ring overrun). */
static void cam_producer_entry(ULONG arg)
{
	(void)arg;
	for (;;) {
		if (!cam_stream_active) {
			(void)tx_semaphore_get(&cam_start_sem, TX_WAIT_FOREVER);
			continue;
		}
		UINT got = tx_semaphore_get(&cam_stream_sem, CAM_PRODUCER_TICK);

		if (mode.is_jpeg)
			cam_stream_service_jpeg(got == TX_SUCCESS);
		else
			cam_stream_service(got == TX_SUCCESS);
	}
}

/* Start streaming with the ring/pipeline built fresh, attaching the counting
   sink plus an optional external sink @p ext (GUIX live preview, #56).  cam_lock
   MUST be held; returns 0 or CAM_ERR_* and NEVER unlocks (the public wrappers
   own the lock).  On success ownership of @p ext is recorded in cam_ext_sink
   (NULL for a plain `camera stream`). */
static int stream_start_locked(int colorbar, uint32_t frames, uint32_t secs,
                               struct frame_sink *ext)
{
	int rc;
	uint32_t slot_size, nslots;

	if (cam_stream_active)
		return CAM_ERR_BUSY;           /* already streaming */
	if (!sdram_is_up())
		return CAM_ERR_STATE;
	if (!info.powered) {
		rc = camera_probe_locked(NULL);
		if (rc != 0)
			return rc;
	}
	/* A streamed frame must fit one DMA NDTR (frame_words <= 65535); bigger modes
	   and JPEG are snapshot-only (mode.streamable is 0). */
	if (!mode.streamable && !mode.is_jpeg)
		return CAM_ERR_STATE;          /* large raster modes are capture-only */

	/* Partition the camera arena (cam_arena, bank1) into ring slots sized to the
	   current mode: slot stride = align32(frame_bytes), as many slots as fit,
	   capped at FRAME_PIPELINE_MAX_SLOTS -- so small modes get a deeper ring
	   (#65).  REJECT (not clamp) when fewer than 2 slots fit: 0/1 slot cannot run
	   the DBM pair, and clamping up to 2 would overflow the arena since
	   frame_pipeline_publish() does not validate bytes <= slot_size (#45). */
	slot_size = (mode.frame_bytes + 31u) & ~31u;
	if (slot_size == 0u || CAM_ARENA_BYTES / slot_size < 2u)
		return CAM_ERR_STATE;
	nslots = CAM_ARENA_BYTES / slot_size;
	if (nslots > FRAME_PIPELINE_MAX_SLOTS)
		nslots = FRAME_PIPELINE_MAX_SLOTS;

	rc = camera_configure_locked(colorbar != 0);
	if (rc != 0)
		return rc;

	/* Program the effective PCLK for the fps knob + current scanout state (#67):
	   30 fps (48 MHz) only takes effect here when the LTDC is not scanning out, so
	   a plain `camera stream start` after `lcd off` runs at 30 fps while one
	   started with the display on (or a GUIX preview) clamps to 15 fps. */
	rc = apply_effective_pclk_locked();
	if (rc != 0)
		return rc;

	/* Build the ring + pipeline fresh over the arena and attach the counting sink
	   (+ ext).  slot_size is the ring slot STRIDE (align32(frame_bytes)), not the
	   frame length -- the DMA writes mode.frame_bytes into each slot's prefix and
	   publish() stamps that as the valid length. */
	if (frame_pipeline_init(&cam_pipe, &cam_pipe_os, cam_arena,
	                        slot_size, nslots) != 0)
		return CAM_ERR_STATE;
	frame_pipeline_set_format(&cam_pipe, fmt_to_frame(mode.format),
	                          mode.width, mode.height);
	if (frame_pipeline_attach(&cam_pipe, &cam_stat_sink) != 0)
		return CAM_ERR_STATE;
	if (ext != NULL && frame_pipeline_attach(&cam_pipe, ext) != 0) {
		frame_pipeline_detach(&cam_pipe, &cam_stat_sink);
		return CAM_ERR_STATE;
	}
	cam_stream_ovr    = 0;
	cam_ring_ovr      = 0;
	cam_stream_fe     = 0;
	cam_ring_slots    = nslots;       /* #65: observable arena partition */
	cam_ring_slot_bytes = slot_size;
	cam_jpeg_trunc    = 0;
	cam_stream_err    = 0;
	cam_stop_req      = 0;
	cam_last_ct       = 0;
	cam_elapsed_ms    = 0;
	cam_start_tick    = HAL_GetTick();
	cam_target_frames = frames;
	cam_target_secs   = secs;
	drain_stream_sem();

	if (mode.is_jpeg) {
		/* JPEG snapshot-loop (#63): one ring slot is the live DMA target and the
		   DCMI FRAME ISR delimits each variable-length frame (no DBM, no TC).  ext
		   is the MJPEG eth_sink (#49 P5) when started via camera_mjpeg_start(), or
		   NULL for a plain `camera stream` -- either way roll back any attached ext
		   on a failure path (like the raster branch below). */
		cam_jpeg_slot = frame_pipeline_acquire(&cam_pipe);
		if (cam_jpeg_slot == NULL) {
			if (ext != NULL)
				frame_pipeline_detach(&cam_pipe, ext);
			frame_pipeline_detach(&cam_pipe, &cam_stat_sink);
			return CAM_ERR_STATE;
		}
		cam_stream_active = 1;             /* arm the ISR + producer */
		if (cam_jpeg_arm(cam_jpeg_slot) != HAL_OK) {
			/* cam_lock is held, so cam_stream_teardown() (which re-takes it) must
			   not run here -- roll back by hand like the raster DMA-start failure. */
			cam_stream_active = 0;
			(void)HAL_DCMI_Stop(&hdcmi);
			__HAL_DCMI_DISABLE_IT(&hdcmi, DCMI_IT_FRAME);  /* cam_jpeg_arm armed it */
			(void)HAL_DMA_DeInit(&hdma_dcmi);
			hdma_dcmi.Init.Mode = DMA_NORMAL;
			(void)HAL_DMA_Init(&hdma_dcmi);
			__HAL_LINKDMA(&hdcmi, DMA_Handle, hdma_dcmi);
			if (ext != NULL)
				frame_pipeline_detach(&cam_pipe, ext);
			frame_pipeline_detach(&cam_pipe, &cam_stat_sink);
			drain_stream_sem();
			LOG_ERR("JPEG stream arm failed");
			return CAM_ERR_HAL;
		}
		cam_ext_sink = ext;               /* #49 P5: record the MJPEG sink owner */
		(void)tx_semaphore_put(&cam_start_sem);
		LOG_INF("stream start jpeg (frames=%lu secs=%lu)",
		        (unsigned long)frames, (unsigned long)secs);
		return 0;
	}

	cam_m0 = frame_pipeline_acquire(&cam_pipe);
	cam_m1 = frame_pipeline_acquire(&cam_pipe);
	if (cam_m0 == NULL || cam_m1 == NULL) {
		if (ext != NULL)
			frame_pipeline_detach(&cam_pipe, ext);
		frame_pipeline_detach(&cam_pipe, &cam_stat_sink);
		return CAM_ERR_STATE;
	}

