owhinata/stm32f746g-disco/port/camera/camera.c
	/* Manual DBM start (the HAL's own >64KB path is intra-frame banding, not
	   inter-frame double buffering).  Order: callbacks -> DMA DBM start ->
	   DCMI CM=0 (continuous, before enable) -> enable -> ERR/OVR IT -> CAPTURE. */
	hdma_dcmi.XferCpltCallback   = cam_stream_dma_cb;
	hdma_dcmi.XferM1CpltCallback = cam_stream_dma_cb;
	hdma_dcmi.XferErrorCallback  = cam_stream_dma_err_cb;
	__HAL_DCMI_CLEAR_FLAG(&hdcmi, DCMI_FLAG_ERRRI | DCMI_FLAG_OVRRI |
	                              DCMI_FLAG_FRAMERI | DCMI_FLAG_LINERI |
	                              DCMI_FLAG_VSYNCRI);

	cam_stream_active = 1;             /* arm the ISR + producer */
	if (HAL_DMAEx_MultiBufferStart_IT(&hdma_dcmi,
	        (uint32_t)&hdcmi.Instance->DR,
	        (uint32_t)cam_m0->data, (uint32_t)cam_m1->data,
	        mode.frame_words) != HAL_OK) {
		cam_stream_active = 0;
		if (ext != NULL)
			frame_pipeline_detach(&cam_pipe, ext);
		frame_pipeline_detach(&cam_pipe, &cam_stat_sink);
		LOG_ERR("stream DMA start failed");
		return CAM_ERR_HAL;
	}
	hdcmi.Instance->CR &= ~DCMI_CR_CM;            /* continuous */
	__HAL_DCMI_ENABLE(&hdcmi);
	__HAL_DCMI_ENABLE_IT(&hdcmi, DCMI_IT_ERR | DCMI_IT_OVR);
	hdcmi.Instance->CR |= DCMI_CR_CAPTURE;
	hdcmi.State = HAL_DCMI_STATE_BUSY;

	cam_ext_sink = ext;               /* record preview ownership (NULL = plain) */

	/* Wake the producer out of its idle FOREVER wait on the dedicated start
	   semaphore -- never the completion semaphore, so it cannot be miscounted. */
	(void)tx_semaphore_put(&cam_start_sem);
	LOG_INF("stream start (frames=%lu secs=%lu%s)",
	        (unsigned long)frames, (unsigned long)secs,
	        ext ? ", gui preview" : "");
	return 0;
}

int camera_stream_start(int colorbar, uint32_t frames, uint32_t secs)
{
	int rc = op_lock();

	if (rc != 0)
		return rc;
	if (cam_ext_sink != NULL) {        /* owned by the GUIX live preview (#56) */
		op_unlock();
		return CAM_ERR_BUSY;
	}
	rc = stream_start_locked(colorbar, frames, secs, NULL);
	op_unlock();
	return rc;
}

int camera_preview_start(struct frame_sink *s, enum camera_res res)
{
	int rc;

	if (s == NULL)
		return CAM_ERR_PARAM;
	/* Preview only accepts the streamable small modes (qqvga/qvga): the bigger
	   raster modes are capture-only (frame_words > 65535) and would set the mode
	   then fail at stream arm, leaving the mode changed (#69).  Format is fixed
	   RGB565 (the #56 GUIX sink's only geometry); fps stays the LTDC-clamped
	   15 fps while the panel scans out. */
	if (res > CAM_RES_QVGA)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	/* JPEG has no LCD decode path (#63): reject preview rather than silently
	   switching the user's selected format to RGB565. */
	if (mode.is_jpeg) {
		op_unlock();
		return CAM_ERR_PARAM;
	}
	/* Set the requested preview resolution (RGB565) regardless of the last
	   `camera res/format`.  Same lock: call the locked helper, never the public
	   camera_set_format (which would re-take cam_lock).  The set_format gate passes
	   because no stream/preview owns the DCMI yet. */
	rc = camera_set_format_locked((uint8_t)res, CAM_FMT_RGB565);
	if (rc == 0)
		rc = stream_start_locked(0, 0, 0, s);
	op_unlock();
	return rc;
}

int camera_mjpeg_start(struct frame_sink *s, enum camera_res res)
{
	int rc;

	if (s == NULL)
		return CAM_ERR_PARAM;
	/* JPEG is the snapshot-loop format and gated to res <= VGA (#63/#69): bigger
	   modes are capture-only.  Unlike camera_preview_start (RGB565 for the LCD),
	   MJPEG (#49 P5) owns the DCMI in JPEG so the eth_sink receives compressed
	   frames straight from frame_pipeline_publish(FRAME_FMT_JPEG). */
	if (res > CAM_RES_VGA)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	/* Set JPEG at the requested resolution, then arm the stream with @p s as the
	   external sink owner.  Both helpers gate on DCMI ownership: if a GUIX preview
	   or a plain `camera stream` already owns the camera they return CAM_ERR_BUSY,
	   so MJPEG never steals the DCMI (#73 ownership model). */
	rc = camera_set_format_locked((uint8_t)res, CAM_FMT_JPEG);
	if (rc == 0)
		rc = stream_start_locked(0, 0, 0, s);
	op_unlock();
	return rc;
}

int camera_preview_stop(struct frame_sink *s)
{
	int inflight = 0;

	if (op_lock() != 0)
		return 0;
	if (s != NULL && cam_ext_sink == s) {
		/* Still the owner: unlink (no more new consume) -- detach reports the
		   pins held for s (incl. a frame already pre-pinned by publish() but not
		   yet consumed), so the caller can drain it -- release ownership, then
		   ask the producer to tear the stream down. */
		inflight = frame_pipeline_detach(&cam_pipe, s);
		cam_ext_sink = NULL;
		if (cam_stream_active) {
			cam_stop_req = 1;
			(void)tx_semaphore_put(&cam_stream_sem);
		}
	}
	/* else: an async teardown (OVR) already released ownership -- do nothing, so
	   a delayed `off` cannot stop a different stream started since. */
	op_unlock();
	return inflight;
}

void camera_frame_put(struct frame_sink *s, const struct frame_desc *f)
{
	frame_pipeline_put(&cam_pipe, s, f);
}

int camera_stream_stop(void)
{
	int rc = op_lock();

	if (rc != 0)
		return rc;
	if (cam_ext_sink != NULL) {        /* owned by the GUIX live preview (#56) */
		op_unlock();
		return CAM_ERR_BUSY;
	}
	if (cam_stream_active) {
		cam_stop_req = 1;
		(void)tx_semaphore_put(&cam_stream_sem);  /* producer tears down */
	}
	op_unlock();
	return 0;
}

int camera_stream_stats(struct camera_stream_info *out)
{
	int rc;

	if (out == NULL)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	/* active / err / elapsed transition under cam_lock; the DCMI/ring overrun
	   counters are volatile (atomic 32-bit reads). */
	out->active     = cam_stream_active;
	out->err        = cam_stream_err;
	out->dcmi_ovr   = cam_stream_ovr;
	out->ring_ovr   = cam_ring_ovr;
	out->dma_fe     = cam_stream_fe;
	out->jpeg_trunc = cam_jpeg_trunc;
	out->slots      = cam_ring_slots;
	out->slot_bytes = cam_ring_slot_bytes;
	out->elapsed_ms = cam_stream_active ? (HAL_GetTick() - cam_start_tick)
	                                    : cam_elapsed_ms;
	/* Coherent snapshot of the pipeline-owned counters (the producer writes them
	   under cam_pipe_lock).  Lock order is always cam_lock -> cam_pipe_lock
	   (matching start / teardown), so this nesting cannot deadlock. */
	(void)tx_mutex_get(&cam_pipe_lock, TX_WAIT_FOREVER);
	out->frames    = cam_pipe.stats.published;
	out->delivered = cam_stat_sink.delivered;
	out->dropped   = cam_stat_sink.dropped;
	(void)tx_mutex_put(&cam_pipe_lock);
	op_unlock();
	return 0;
}

