owhinata/stm32f746g-disco/port/camera/camera.c
int camera_init(void)
{
	GPIO_InitTypeDef g = {0};
	OV5640_IO_t io;

	if (cam_ready)
		return 0;

	if (tx_mutex_create(&cam_lock, "camera", TX_INHERIT) != TX_SUCCESS)
		return CAM_ERR_STATE;
	if (tx_semaphore_create(&cam_done, "cam_done", 0) != TX_SUCCESS) {
		tx_mutex_delete(&cam_lock);
		return CAM_ERR_STATE;
	}
	/* Streaming (issue #46): the pipeline's frame_os mutex and the DMA-TC ->
	   producer wakeup semaphore.  The producer thread is created at the end. */
	if (tx_mutex_create(&cam_pipe_lock, "campipe", TX_INHERIT) != TX_SUCCESS) {
		tx_semaphore_delete(&cam_done);
		tx_mutex_delete(&cam_lock);
		return CAM_ERR_STATE;
	}
	if (tx_semaphore_create(&cam_stream_sem, "cam_strm", 0) != TX_SUCCESS) {
		tx_mutex_delete(&cam_pipe_lock);
		tx_semaphore_delete(&cam_done);
		tx_mutex_delete(&cam_lock);
		return CAM_ERR_STATE;
	}
	if (tx_semaphore_create(&cam_start_sem, "cam_strt", 0) != TX_SUCCESS) {
		tx_semaphore_delete(&cam_stream_sem);
		tx_mutex_delete(&cam_pipe_lock);
		tx_semaphore_delete(&cam_done);
		tx_mutex_delete(&cam_lock);
		return CAM_ERR_STATE;
	}

	__HAL_RCC_GPIOA_CLK_ENABLE();
	__HAL_RCC_GPIOB_CLK_ENABLE();
	__HAL_RCC_GPIOD_CLK_ENABLE();
	__HAL_RCC_GPIOE_CLK_ENABLE();
	__HAL_RCC_GPIOG_CLK_ENABLE();
	__HAL_RCC_GPIOH_CLK_ENABLE();
	__HAL_RCC_I2C1_CLK_ENABLE();
	__HAL_RCC_DCMI_CLK_ENABLE();
	__HAL_RCC_DMA2_CLK_ENABLE();

	/* PWR_EN: drive the OFF level while the pin is still an input so the
	   output never glitches the module on. */
	HAL_GPIO_WritePin(CAM_PWR_PORT, CAM_PWR_PIN, GPIO_PIN_SET);
	g.Pin   = CAM_PWR_PIN;
	g.Mode  = GPIO_MODE_OUTPUT_PP;
	g.Pull  = GPIO_NOPULL;
	g.Speed = GPIO_SPEED_FREQ_LOW;
	HAL_GPIO_Init(CAM_PWR_PORT, &g);

	/* I2C1: PB8 = SCL, PB9 = SDA (UM1907 CN2/P1), AF4 open-drain.  The bus
	   has 4.7k pull-ups on the board. */
	g.Pin       = GPIO_PIN_8 | GPIO_PIN_9;
	g.Mode      = GPIO_MODE_AF_OD;
	g.Pull      = GPIO_NOPULL;
	g.Speed     = GPIO_SPEED_FREQ_HIGH;
	g.Alternate = GPIO_AF4_I2C1;
	HAL_GPIO_Init(GPIOB, &g);

	hcam_i2c.Instance              = I2C1;
	hcam_i2c.Init.Timing           = CAM_I2C_TIMING;
	hcam_i2c.Init.OwnAddress1      = 0;
	hcam_i2c.Init.AddressingMode   = I2C_ADDRESSINGMODE_7BIT;
	hcam_i2c.Init.DualAddressMode  = I2C_DUALADDRESS_DISABLE;
	hcam_i2c.Init.OwnAddress2      = 0;
	hcam_i2c.Init.GeneralCallMode  = I2C_GENERALCALL_DISABLE;
	hcam_i2c.Init.NoStretchMode    = I2C_NOSTRETCH_DISABLE;
	if (HAL_I2C_Init(&hcam_i2c) != HAL_OK) {
		LOG_ERR("I2C1 init failed");
		goto fail;
	}

	/* DCMI pins (P1, AF13): PA4=HSYNC, PA6=PIXCLK, PG9=VSYNC, PD3=D5,
	   PE5=D6, PE6=D7, PH9..PH12,PH14=D0..D4.  Pull-up like the ST BSP. */
	g.Mode      = GPIO_MODE_AF_PP;
	g.Pull      = GPIO_PULLUP;
	g.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
	g.Alternate = GPIO_AF13_DCMI;
	g.Pin       = GPIO_PIN_4 | GPIO_PIN_6;
	HAL_GPIO_Init(GPIOA, &g);
	g.Pin       = GPIO_PIN_3;
	HAL_GPIO_Init(GPIOD, &g);
	g.Pin       = GPIO_PIN_5 | GPIO_PIN_6;
	HAL_GPIO_Init(GPIOE, &g);
	g.Pin       = GPIO_PIN_9;
	HAL_GPIO_Init(GPIOG, &g);
	g.Pin       = GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12 |
	              GPIO_PIN_14;
	HAL_GPIO_Init(GPIOH, &g);

	/* DMA2 Stream1/Ch1: DCMI -> memory, single-shot per frame (DMA_NORMAL).
	   32-bit words both sides (the DCMI DR packs four 8-bit pixels), FIFO on
	   with INC4 memory bursts; the peripheral side stays single-beat reads
	   of the one DR register.  NB: streaming arms this in double-buffer mode,
	   which (unlike the snapshot HAL_DMA_Start_IT) enables the DMA FIFO-error
	   interrupt; FE/DME are non-fatal (RM0385 8.5.5 -- they do not disable the
	   stream) and transient under SDRAM contention, so cam_stream_dma_err_cb
	   treats only a transfer error (TE) as terminal (#56). */
	hdma_dcmi.Instance                 = DMA2_Stream1;
	hdma_dcmi.Init.Channel             = DMA_CHANNEL_1;
	hdma_dcmi.Init.Direction           = DMA_PERIPH_TO_MEMORY;
	hdma_dcmi.Init.PeriphInc           = DMA_PINC_DISABLE;
	hdma_dcmi.Init.MemInc              = DMA_MINC_ENABLE;
	hdma_dcmi.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
	hdma_dcmi.Init.MemDataAlignment    = DMA_MDATAALIGN_WORD;
	hdma_dcmi.Init.Mode                = DMA_NORMAL;
	hdma_dcmi.Init.Priority            = DMA_PRIORITY_HIGH;
	hdma_dcmi.Init.FIFOMode            = DMA_FIFOMODE_ENABLE;
	hdma_dcmi.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
	hdma_dcmi.Init.MemBurst            = DMA_MBURST_INC4;
	hdma_dcmi.Init.PeriphBurst         = DMA_PBURST_SINGLE;
	if (HAL_DMA_Init(&hdma_dcmi) != HAL_OK) {
		LOG_ERR("DCMI DMA init failed");
		goto fail_i2c;
	}
	__HAL_LINKDMA(&hdcmi, DMA_Handle, hdma_dcmi);

	/* DCMI: 8-bit, hardware sync, the H747I BSP's proven OV5640 polarities
	   (OV5640_Init programs the matching sensor side). */
	hdcmi.Instance               = DCMI;
	hdcmi.Init.SynchroMode       = DCMI_SYNCHRO_HARDWARE;
	hdcmi.Init.PCKPolarity       = DCMI_PCKPOLARITY_RISING;
	hdcmi.Init.VSPolarity        = DCMI_VSPOLARITY_HIGH;
	hdcmi.Init.HSPolarity        = DCMI_HSPOLARITY_HIGH;
	hdcmi.Init.CaptureRate       = DCMI_CR_ALL_FRAME;
	hdcmi.Init.ExtendedDataMode  = DCMI_EXTEND_DATA_8B;
	hdcmi.Init.JPEGMode          = DCMI_JPEG_DISABLE;
	if (HAL_DCMI_Init(&hdcmi) != HAL_OK) {
		(void)HAL_DMA_DeInit(&hdma_dcmi);
		LOG_ERR("DCMI init failed");
		goto fail_i2c;
	}

	/* NVIC: below USART1 (5) / SDMMC1 (6) / SD DMA (7), above SysTick (14).
	   The ThreadX port masks with PRIMASK, so tx_semaphore_put from these
	   ISRs is safe whatever the numeric priority. */
	HAL_NVIC_SetPriority(DCMI_IRQn, 8, 0);
	HAL_NVIC_EnableIRQ(DCMI_IRQn);
	HAL_NVIC_SetPriority(DMA2_Stream1_IRQn, 8, 0);
	HAL_NVIC_EnableIRQ(DMA2_Stream1_IRQn);

	/* Bind the component driver to this bus once; Address is the 8-bit
	   write address the HAL Mem API expects. */
	io.Init      = cam_io_init;
	io.DeInit    = cam_io_deinit;
	io.Address   = CAM_I2C_ADDR;
	io.WriteReg  = cam_io_write;
	io.ReadReg   = cam_io_read;
	io.ModifyReg = NULL;
	io.GetTick   = cam_io_gettick;
	if (OV5640_RegisterBusIO(&ov5640, &io) != OV5640_OK) {
		(void)HAL_DCMI_DeInit(&hdcmi);
		(void)HAL_DMA_DeInit(&hdma_dcmi);
		LOG_ERR("OV5640 bus registration failed");
		goto fail_i2c;
	}

	/* The streaming counting sink (issue #46) -- format-validated at attach. */
	cam_stat_sink.name    = "stats";
	cam_stat_sink.ctx     = NULL;
	cam_stat_sink.policy  = FRAME_POLICY_DROP;
	cam_stat_sink.open    = cam_stat_open;
	cam_stat_sink.consume = cam_stat_consume;
	cam_stat_sink.close   = NULL;

	/* Dedicated producer thread: idles until a stream starts. */
	if (tx_thread_create(&cam_producer, "cam_prod", cam_producer_entry, 0,
	                     cam_producer_stack, sizeof cam_producer_stack,
	                     CAM_PRODUCER_PRIO, CAM_PRODUCER_PRIO,
	                     TX_NO_TIME_SLICE, TX_AUTO_START) != TX_SUCCESS) {
		(void)HAL_DCMI_DeInit(&hdcmi);
		(void)HAL_DMA_DeInit(&hdma_dcmi);
		LOG_ERR("camera producer thread create failed");
		goto fail_i2c;
	}

	mode_recompute(&mode);    /* fill geometry/derived fields for the default */

